lvgl-micropython/lvgl_micropython/micropy_updates/esp32/machine_i2c.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2019 Damien P. George
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include "py/runtime.h"
#include "py/mphal.h"
#include "py/mperrno.h"
#include "extmod/modmachine.h"

#include "driver/i2c.h"
#include "hal/i2c_ll.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"


#if MICROPY_PY_MACHINE_I2C || MICROPY_PY_MACHINE_SOFTI2C
    #include "../../../../micropy_updates/common/mp_i2c_common.h"

    #ifndef MICROPY_HW_I2C0_SCL
        #define MICROPY_HW_I2C0_SCL (GPIO_NUM_18)
        #define MICROPY_HW_I2C0_SDA (GPIO_NUM_19)
    #endif

    #ifndef MICROPY_HW_I2C1_SCL
        #if CONFIG_IDF_TARGET_ESP32
            #define MICROPY_HW_I2C1_SCL (GPIO_NUM_25)
            #define MICROPY_HW_I2C1_SDA (GPIO_NUM_26)
        #else
            #define MICROPY_HW_I2C1_SCL (GPIO_NUM_9)
            #define MICROPY_HW_I2C1_SDA (GPIO_NUM_8)
        #endif
    #endif

    #if CONFIG_IDF_TARGET_ESP32C3 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32S3
        #define I2C_SCLK_FREQ XTAL_CLK_FREQ
    #elif CONFIG_IDF_TARGET_ESP32 || CONFIG_IDF_TARGET_ESP32S2
        #define I2C_SCLK_FREQ APB_CLK_FREQ
    #else
        #error "unsupported I2C for ESP32 SoC variant"
    #endif

    #define I2C_DEFAULT_TIMEOUT_US (50000) // 50ms


    static void device_deinit_internal(mp_machine_hw_i2c_device_obj_t *self);
    static void bus_deinit_internal(mp_machine_hw_i2c_bus_obj_t *self);

    static mp_machine_hw_i2c_bus_obj_t machine_hw_i2c_obj[I2C_NUM_MAX];


    #define I2C_BUS_LOCK_ACQUIRE(self) xSemaphoreTake(self->lock.handle, portMAX_DELAY)
    #define I2C_BUS_LOCK_DELETE(self) vSemaphoreDelete(self->lock.handle)
    #define I2C_BUS_LOCK_RELEASE(self) xSemaphoreGive(self->lock.handle)
    #define I2C_BUS_LOCK_INIT(self) { \
        lock->handle = xSemaphoreCreateBinaryStatic(&self->lock.buffer); \
        xSemaphoreGive(self->lock.handle); \
    }


    // ********************** machine.I2C.Bus ************************

    void mp_machine_hw_i2c_bus_deinit_all(void)
    {
        // we need to copy the existing array to a new one so the order doesn't
        // get all mucked up when objects get removed.

        for (uint8_t i=0;i<I2C_NUM_MAX;i++) {
            if (machine_hw_i2c_obj[i].active == 0) continue;

            uint8_t device_count = machine_hw_i2c_obj[i].device_count;
            mp_machine_hw_i2c_device_obj_t *device_objs[device_count];

            for (uint8_t j=0;j<device_count;j++) {
                device_objs[j] = machine_hw_i2c_obj[i].devices[j];
            }

            for (uint8_t j=0;j<device_count;j++) {
                device_deinit_internal(device_objs[j]);
            }
        }
    }


    void i2c_bus_deinit_internal(mp_machine_hw_i2c_bus_obj_t *self)
    {
        if (self->active == 1) {
            self->active = 0;

            if (self->use_locks == 1) {
                I2C_BUS_LOCK_ACQUIRE(self);
                I2C_BUS_LOCK_RELEASE(self);
                I2C_BUS_LOCK_DELETE(self);
            }
            i2c_driver_delete(self->port);
            self->base.type = NULL;
        }
    }


    static void i2c_bus_init_internal(mp_machine_hw_i2c_bus_obj_t *self, uint32_t freq, uint32_t timeout_us)
    {
        i2c_bus_deinit_internal(self);

        i2c_config_t conf = {
            .mode = I2C_MODE_MASTER,
            .sda_io_num = self->sda,
            .sda_pullup_en = (bool)self->pullup,
            .scl_io_num = self->scl,
            .scl_pullup_en = (bool)self->pullup,
            .master.clk_speed = freq
        };

        i2c_param_config(self->port, &conf);

        int timeout = I2C_SCLK_FREQ / 1000000 * timeout_us;

        i2c_set_timeout(self->port, (timeout > I2C_LL_MAX_TIMEOUT) ? I2C_LL_MAX_TIMEOUT : timeout);
        i2c_driver_install(self->port, I2C_MODE_MASTER, 0, 0, 0);

        self->active = 1;
    }


    static int i2c_bus_transfer(mp_obj_base_t *self_in, uint16_t addr, size_t n,
                                           mp_machine_i2c_buf_t *bufs, unsigned int flags)
    {
        mp_machine_hw_i2c_bus_obj_t *self = MP_OBJ_TO_PTR(self_in);

        if (self->active == 1) {
            if (self->use_locks == 1) I2C_BUS_LOCK_ACQUIRE(self);

            i2c_cmd_handle_t cmd = i2c_cmd_link_create();
            int data_len = 0;

            if (flags & MP_MACHINE_I2C_FLAG_WRITE1) {
                i2c_master_start(cmd);
                i2c_master_write_byte(cmd, addr << 1, true);
                i2c_master_write(cmd, bufs->buf, bufs->len, true);
                data_len += bufs->len;
                --n;
                ++bufs;
            }

            i2c_master_start(cmd);
            i2c_master_write_byte(cmd, addr << 1 | (flags & MP_MACHINE_I2C_FLAG_READ), true);

            for (; n--; ++bufs) {
                if (flags & MP_MACHINE_I2C_FLAG_READ) {
                    i2c_master_read(cmd, bufs->buf, bufs->len, n == 0 ? I2C_MASTER_LAST_NACK : I2C_MASTER_ACK);
                } else {
                    if (bufs->len != 0) {
                        i2c_master_write(cmd, bufs->buf, bufs->len, true);
                    }
                }
                data_len += bufs->len;
            }

            if (flags & MP_MACHINE_I2C_FLAG_STOP) {
                i2c_master_stop(cmd);
            }

            // TODO proper timeout
            esp_err_t err = i2c_master_cmd_begin(self->port, cmd, 100 * (1 + data_len) / portTICK_PERIOD_MS);
            i2c_cmd_link_delete(cmd);

            if (self->use_locks == 1) I2C_BUS_LOCK_RELEASE(self);

