lvgl-micropython/lvgl_micropython/micropy_updates/esp32/machine_i2c.c
            if (err == ESP_FAIL) {
                return -MP_ENODEV;
            } else if (err == ESP_ERR_TIMEOUT) {
                return -MP_ETIMEDOUT;
            } else if (err != ESP_OK) {
                return -abs(err);
            }

            return data_len;
        } else {
            return -MP_ENODEV;
        }
    }


    static void i2c_bus_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind)
    {
        machine_hw_i2c_obj_t *self = MP_OBJ_TO_PTR(self_in);
        int h, l;
        i2c_get_period(self->port, &h, &l);
        mp_printf(print, "I2C(%u, scl=%u, sda=%u, freq=%u)",
            self->port, self->scl, self->sda, I2C_SCLK_FREQ / (h + l));
    }


    static mp_obj_t i2c_bus_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {
        // MP_MACHINE_I2C_CHECK_FOR_LEGACY_SOFTI2C_CONSTRUCTION(n_args, n_kw, all_args);

        // Parse args
        enum { ARG_host, ARG_scl, ARG_sda, ARG_freq, ARG_use_locks, ARG_pullup, ARG_timeout };
        static const mp_arg_t allowed_args[] = {
            { MP_QSTR_host,      MP_ARG_REQUIRED | MP_ARG_INT },
            { MP_QSTR_scl,       MP_ARG_REQUIRED | MP_ARG_INT },
            { MP_QSTR_sda,       MP_ARG_REQUIRED | MP_ARG_INT },
            { MP_QSTR_freq,      MP_ARG_INT,  { .u_int = 400000} },
            { MP_QSTR_use_locks, MP_ARG_BOOL, { .u_bool = false } },
            { MP_QSTR_pullup,    MP_ARG_BOOL, { .u_bool = false } },
            { MP_QSTR_timeout,   MP_ARG_INT,  { .u_int = I2C_DEFAULT_TIMEOUT_US } },
        };
        mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
        mp_arg_parse_all_kw_array(n_args, n_kw, all_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

        // Get I2C bus
        uint8_t i2c_id = (uint8_t)args[ARG_host].u_int);
        if (!(I2C_NUM_0 <= i2c_id && i2c_id < I2C_NUM_MAX)) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("I2C(%u) doesn't exist"), i2c_id);
        }

        // Get static peripheral object
        mp_machine_hw_i2c_bus_obj_t *self = (mp_machine_hw_i2c_bus_obj_t *)&machine_hw_i2c_obj[i2c_id];

        if (self->base.type != NULL) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("I2C host is already in use (%u)"), i2c_id);
        }
        // Created for the first time, set default pins
        self->base.type = &mp_machine_i2c_bus_type;
        self->port = i2c_id;
        self->active = 0;
        self->device_count = 0;

        self->scl = (gpio_num_t)args[ARG_scl].u_int;
        self->sda = (gpio_num_t)args[ARG_sda].u_int;
        self->freq = (uint32_t)args[ARG_freq].u_int;
        self->timeout_us = (uint32_t)args[ARG_timeout].u_int;
        self->pullup = (uint8_t)args[ARG_pullup].u_bool;
        self->use_locks = (uint8_t)args[ARG_use_locks].u_bool;

        if (self->use_locks == 1) I2C_BUS_LOCK_INIT(self)

        i2c_bus_init_internal(self, self->freq, self->timeout_us);

        return MP_OBJ_FROM_PTR(self);
    }


    static const mp_machine_i2c_p_t i2c_bus_p = {
        .transfer_supports_write1 = true,
        .transfer = i2c_bus_transfer,
    };


    MP_DEFINE_CONST_OBJ_TYPE(
        mp_machine_hw_i2c_bus_type,
        MP_QSTR_Bus,
        MP_TYPE_FLAG_NONE,
        make_new, i2c_bus_make_new,
        print, i2c_bus_print,
        protocol, &i2c_bus_p,
        locals_dict, &mp_machine_i2c_locals_dict
    );


    // ********************** machine.I2C.Device ************************

    static size_t get_memaddr_buf(uint8_t *memaddr_buf, uint32_t memaddr, uint8_t addrsize) {
        size_t memaddr_len = 0;
        if ((addrsize & 7) != 0 || addrsize > 32) {
            mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("invalid mem address size (%u)"), addrsize);
        }

        for (int16_t i = addrsize - 8; i >= 0; i -= 8) {
            memaddr_buf[memaddr_len++] = memaddr >> i;
        }

        return memaddr_len;
    }


    static int device_read(mp_machine_hw_i2c_device_obj_t *self, uint16_t addr, uint32_t memaddr,
                           uint8_t addrsize, uint8_t *buf, size_t len)
    {
        if (self->bus == NULL) return -1;

        mp_obj_base_t *bus = (mp_obj_base_t *)self->bus;

        // Create buffer with memory address
        uint8_t memaddr_buf[4];
        size_t memaddr_len = get_memaddr_buf(&memaddr_buf[0], memaddr, addrsize);

        // Create partial write and read buffers
        mp_machine_i2c_buf_t bufs[2] = {
            {.len = memaddr_len, .buf = memaddr_buf},
            {.len = len, .buf = buf},
        };

        // Do write+read I2C transfer
        return i2c_bus_transfer(bus, addr, 2, bufs,
               MP_MACHINE_I2C_FLAG_WRITE1 | MP_MACHINE_I2C_FLAG_READ | MP_MACHINE_I2C_FLAG_STOP);
    }


    static int device_write(mp_machine_hw_i2c_device_obj_t *self, uint16_t addr, uint32_t memaddr,
                            uint8_t addrsize, const uint8_t *buf, size_t len)
    {
        if (self->bus == NULL) return -1;

        mp_obj_base_t *bus = (mp_obj_base_t *)self->bus;

        // Create buffer with memory address
        uint8_t memaddr_buf[4];
        size_t memaddr_len = fill_memaddr_buf(&memaddr_buf[0], memaddr, addrsize);

        // Create partial write buffers
        mp_machine_i2c_buf_t bufs[2] = {
            {.len = memaddr_len, .buf = memaddr_buf},
            {.len = len, .buf = (uint8_t *)buf},
        };

        // Do I2C transfer
        return i2c_bus_transfer(bus, addr, 2, bufs, MP_MACHINE_I2C_FLAG_STOP);
    }


    static int device_readfrom(mp_machine_hw_i2c_device_obj_t *self, uint16_t addr,
                               uint8_t *dest, size_t len, bool stop)
    {
        if (self->bus == NULL) return -1;

        mp_obj_base_t *bus = (mp_obj_base_t *)self->bus;

        mp_machine_i2c_buf_t buf = {.len = len, .buf = dest};

        return i2c_bus_transfer(bus, addr, 1,
               &buf, MP_MACHINE_I2C_FLAG_READ | (stop ? MP_MACHINE_I2C_FLAG_STOP : 0));
    }


    static int device_writeto(mp_machine_hw_i2c_device_obj_t *self, uint16_t addr,
                              const uint8_t *src, size_t len, bool stop)
    {
        if (self->bus == NULL) return -1;

        mp_obj_base_t *bus = (mp_obj_base_t *)self->bus;

        mp_machine_i2c_buf_t buf = {.len = len, .buf = (uint8_t *)src};

