lvgl-micropython/lvgl_micropython/micropy_updates/esp32/machine_i2c.c
        return i2c_bus_transfer(bus, addr, 1, &buf, stop ? MP_MACHINE_I2C_FLAG_STOP : 0);
    }


    void device_deinit_internal(mp_machine_hw_i2c_device_obj_t *self)
    {
        if (self->bus == NULL) return;

        uint8_t i = 0

        for (;i<self->bus->device_count;i++) {
            if (self->bus->devices[i] == self) {
                self->bus->devices[i] = NULL;
                break;
            }
        }

        for (uint8_t j=0;j<self->bus->device_count;j++) {
            self->bus->devices[j - i + 1] = self->bus->devices[j];
        }

        self->bus->device_count--;
        self->bus->devices = m_realloc(self->bus->devices, self->bus->device_count * sizeof(mp_machine_hw_i2c_device_obj_t *));

        self->bus = NULL;
    }


    static mp_obj_t i2c_device_deinit(mp_obj_t self_in)
    {
        mp_machine_hw_i2c_device_obj_t *self = MP_OBJ_TO_PTR(self_in);
        device_deinit_internal(self);
        return mp_const_none;
    }

    MP_DEFINE_CONST_FUN_OBJ_1(i2c_device_deinit_obj, i2c_device_deinit);


    static mp_obj_t i2c_device_write_readinto(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args)
    {
        enum { ARG_self, ARG_write_buf, ARG_read_buf };
        static const mp_arg_t allowed_args[] = {
            { MP_QSTR_self,         MP_ARG_OBJ | MP_ARG_REQUIRED },
            { MP_QSTR_write_buf,    MP_ARG_OBJ | MP_ARG_REQUIRED },
            { MP_QSTR_read_buf,     MP_ARG_OBJ | MP_ARG_REQUIRED },
        };

        mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
        mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

        mp_machine_hw_i2c_device_obj_t *self = MP_OBJ_TO_PTR(args[ARG_self].u_obj);

        mp_buffer_info_t write_bufinfo;
        mp_get_buffer_raise(args[ARG_write_buf].u_obj, &write_bufinfo, MP_BUFFER_READ);

        mp_buffer_info_t read_bufinfo;
        mp_get_buffer_raise(args[ARG_write_buf].u_obj, &read_bufinfo, MP_BUFFER_WRITE);

        uint32_t memaddr = 0;

        for (uint8_t i=(self->reg_bits / 8) - 1;i>-1;i--) {
            memaddr |= (uint32_t)(((uint8_t)write_bufinfo.buf[i]) << ((~i + (self.reg_bits / 8)) * 8));
        }

        int ret = device_read(self, self->device_id, memaddr, self->reg_bits, (uint8_t *)read_bufinfo.buf, read_bufinfo.len);
        if (ret < 0) {
            mp_raise_OSError(-ret);
        }

        return mp_const_none;
    }

    static MP_DEFINE_CONST_FUN_OBJ_KW(i2c_device_write_readinto_obj, 3, i2c_device_write_readinto);


    static mp_obj_t i2c_device_read_mem(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args)
    {
        enum { ARG_self, ARG_memaddr, ARG_num_bytes, ARG_buf };
        static const mp_arg_t allowed_args[] = {
            { MP_QSTR_self,         MP_ARG_OBJ | MP_ARG_REQUIRED },
            { MP_QSTR_memaddr,      MP_ARG_INT | MP_ARG_REQUIRED },
            { MP_QSTR_num_bytes,    MP_ARG_INT | MP_ARG_KW_ONLY, { .u_int = -1 } },
            { MP_QSTR_buf,          MP_ARG_OBJ | MP_ARG_KW_ONLY, { .u_obj = mp_const_none } },
        };
        mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
        mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

        mp_machine_hw_i2c_device_obj_t *self = MP_OBJ_TO_PTR(args[ARG_self].u_obj);

        uint32_t memaddr = (uint32_t)args[ARG_memaddr].u_int;
        int ret;

        if (args[ARG_buf].u_obj != mp_const_none) {
            mp_buffer_info_t bufinfo;
            mp_get_buffer_raise(args[ARG_buf].u_obj, &bufinfo, MP_BUFFER_WRITE);

            ret = device_read(self, self->device_id, memaddr, self->reg_bits, (uint8_t *)bufinfo.buf, bufinfo.len);
            if (ret < 0) {
                mp_raise_OSError(-ret);
            }

            return mp_const_none;
        } else {
            int num_bytes = (int)args[ARG_num_bytes].u_int;
            // create the buffer to store data into
            vstr_t vstr;
            vstr_init_len(&vstr, num_bytes);

            // do the transfer
            ret = device_read(self, self->device_id, memaddr, self->reg_bits, (uint8_t *)vstr.buf, vstr.len);
            if (ret < 0) {
                mp_raise_OSError(-ret);
            }

            return mp_obj_new_bytes_from_vstr(&vstr);
        }
    }

    static MP_DEFINE_CONST_FUN_OBJ_KW(i2c_device_read_mem_obj, 2, i2c_device_read_mem);


    static mp_obj_t i2c_device_write_mem(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args)
    {
        enum { ARG_self, ARG_memaddr, ARG_buf };
        static const mp_arg_t allowed_args[] = {
            { MP_QSTR_self,         MP_ARG_OBJ | MP_ARG_REQUIRED },
            { MP_QSTR_memaddr,      MP_ARG_INT | MP_ARG_REQUIRED },
            { MP_QSTR_buf,          MP_ARG_OBJ | MP_ARG_REQUIRED },
        };
        mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
        mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

        mp_machine_hw_i2c_device_obj_t *self = MP_OBJ_TO_PTR(args[ARG_self].u_obj);

        uint32_t memaddr = (uint32_t)args[ARG_memaddr].u_int;

        mp_buffer_info_t bufinfo;
        mp_get_buffer_raise(args[ARG_buf].u_obj, &bufinfo, MP_BUFFER_READ);

        int ret = device_write(self, self->device_id, memaddr, self->reg_bits, (uint8_t *)bufinfo.buf, bufinfo.len);
        if (ret < 0) {
            mp_raise_OSError(-ret);
        }

        return mp_const_none;
    }

    static MP_DEFINE_CONST_FUN_OBJ_KW(i2c_device_write_mem_obj, 3, i2c_device_write_mem);


    static mp_obj_t i2c_device_read(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args)
    {
        enum { ARG_self, ARG_num_bytes, ARG_buf };
        static const mp_arg_t allowed_args[] = {
            { MP_QSTR_self,         MP_ARG_OBJ | MP_ARG_REQUIRED },
            { MP_QSTR_num_bytes,    MP_ARG_INT | MP_ARG_KW_ONLY, { .u_int = -1 } },
            { MP_QSTR_buf,          MP_ARG_OBJ | MP_ARG_KW_ONLY, { .u_obj = mp_const_none }},
        };
        mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
        mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

