lvgl-micropython/lvgl_micropython/micropy_updates/esp32/machine_i2c.c
        mp_machine_hw_i2c_device_obj_t *self = MP_OBJ_TO_PTR(args[ARG_self].u_obj);

        int ret;

        if (args[ARG_buf].u_obj != mp_const_none) {
            mp_buffer_info_t bufinfo;
            mp_get_buffer_raise(args[ARG_buf].u_obj, &bufinfo, MP_BUFFER_WRITE);

            ret = device_readfrom(self, self->device_id, (uint8_t *)bufinfo.buf, bufinfo.len, true);
            if (ret < 0) {
                mp_raise_OSError(-ret);
            }

            return mp_const_none;
        } else {
            int num_bytes = (int)args[ARG_num_bytes].u_int;
            // create the buffer to store data into
            vstr_t vstr;
            vstr_init_len(&vstr, num_bytes);

            // do the transfer
            ret = device_readfrom(self, self->device_id, (uint8_t *)vstr.buf, vstr.len);
            if (ret < 0) {
                mp_raise_OSError(-ret);
            }

            return mp_obj_new_bytes_from_vstr(&vstr);
        }
    }

    static MP_DEFINE_CONST_FUN_OBJ_KW(i2c_device_read_obj, 1, i2c_device_read);


    static mp_obj_t i2c_device_write(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args)
    {
        enum { ARG_self, ARG_num_bytes, ARG_buf };
        static const mp_arg_t allowed_args[] = {
            { MP_QSTR_self,         MP_ARG_OBJ | MP_ARG_REQUIRED },
            { MP_QSTR_buf,          MP_ARG_OBJ | MP_ARG_REQUIRED },
        };
        mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
        mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

        mp_machine_hw_i2c_device_obj_t *self = MP_OBJ_TO_PTR(args[ARG_self].u_obj);


        mp_buffer_info_t bufinfo;
        mp_get_buffer_raise(args[ARG_buf].u_obj, &bufinfo, MP_BUFFER_READ);

        ret = device_writeto(self, self->device_id, (uint8_t *)bufinfo.buf, bufinfo.len, true);
        if (ret < 0) {
            mp_raise_OSError(-ret);
        }

        return mp_const_none;
    }

    static MP_DEFINE_CONST_FUN_OBJ_KW(i2c_device_write_obj, 2, i2c_device_write);


    mp_obj_t i2c_device_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *all_args) {

        // Parse args
        enum { ARG_bus, ARG_device_id, ARG_reg_bits };
        static const mp_arg_t allowed_args[] = {
            { MP_QSTR_bus,       MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_OBJ },
            { MP_QSTR_device_id, MP_ARG_KW_ONLY | MP_ARG_REQUIRED | MP_ARG_INT },
            { MP_QSTR_reg_bits,  MP_ARG_KW_ONLY | MP_ARG_INT, { .u_int = 8 } }
        };

        mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
        mp_arg_parse_all_kw_array(
            n_args,
            n_kw,
            all_args,
            MP_ARRAY_SIZE(allowed_args),
            allowed_args,
            args
        );

        // create new object
        mp_machine_hw_i2c_device_obj_t *self = m_new_obj(mp_machine_hw_i2c_device_obj_t);
        self->base.type = &mp_machine_hw_i2c_device_type;

        self->bus = (mp_machine_hw_i2c_bus_obj_t *)args[ARG_bus].u_obj;
        self->device_id = (uint16_t)args[ARG_device_id].u_int;
        self->reg_bits =  (uint8_t)args[ARG_reg_bits].u_int;

        self->bus->device_count++;
        self->bus->devices = m_realloc(self->bus->devices, self->bus->device_count * sizeof(mp_machine_hw_i2c_device_obj_t *));
        self->bus->devices[self->bus->device_count - 1] = self;

        return MP_OBJ_FROM_PTR(self);
    }


    static const mp_rom_map_elem_t i2c_device_locals_dict_table[] = {
        { MP_ROM_QSTR(MP_QSTR_init),           MP_ROM_PTR(&machine_i2c_init_obj)          },
        { MP_ROM_QSTR(MP_QSTR_write_readinto), MP_ROM_PTR(&i2c_device_write_readinto_obj) },
        { MP_ROM_QSTR(MP_QSTR_read_mem),       MP_ROM_PTR(&i2c_device_read_mem_obj)       },
        { MP_ROM_QSTR(MP_QSTR_write_mem),      MP_ROM_PTR(&i2c_device_write_mem_obj)      },
        { MP_ROM_QSTR(MP_QSTR_read),           MP_ROM_PTR(&i2c_device_read_obj)           },
        { MP_ROM_QSTR(MP_QSTR_write),          MP_ROM_PTR(&i2c_device_write_obj)          },
        { MP_ROM_QSTR(MP_QSTR___del__),        MP_ROM_PTR(&i2c_device_deinit_obj)         }
    };


    MP_DEFINE_CONST_DICT(i2c_device_locals_dict, i2c_device_locals_dict_table);


    MP_DEFINE_CONST_OBJ_TYPE(
        mp_machine_hw_i2c_device_type,
        MP_QSTR_Device,
        MP_TYPE_FLAG_NONE,
        make_new, i2c_device_make_new,
        locals_dict, &i2c_device_locals_dict
    );



    // ********************** machine.I2C ************************

    static const mp_rom_map_elem_t i2c_globals_dict_table[] = {
        { MP_ROM_QSTR(MP_QSTR___name__),  MP_OBJ_NEW_QSTR(MP_QSTR_I2C)   },
        { MP_ROM_QSTR(MP_QSTR_Bus),       (mp_obj_t)&mp_machine_hw_i2c_bus_type },
        { MP_ROM_QSTR(MP_QSTR_Device),    (mp_obj_t)&mp_machine_hw_i2c_device_type }
    };


    static MP_DEFINE_CONST_DICT(i2c_globals_dict, i2c_globals_dict_table);


    const mp_obj_module_t mp_module_i2c = {
        .base    = {&mp_type_module},
        .globals = (mp_obj_dict_t *)&i2c_globals_dict,
    };

    MP_REGISTER_MODULE(MP_QSTR_I2C, mp_module_i2c);
#else
    void mp_machine_hw_i2c_bus_deinit_all(void) {}

#endif /* MICROPY_PY_MACHINE_I2C || MICROPY_PY_MACHINE_SOFTI2C */